IDS_RUS_CODE_REPORT_EN_TEST = "EC_Report_EN-Test(Lang:EN)"
IDS_RUS_DLL_ERROR = "กำลังลิงก์เวอร์ชัน dll ที่ไม่ถูกต้อง"
IDS_RUS_DLL_ERROR_REPORT = "ไม่สามารถเริ่มต้น COM dll ได้"
IDS_CVL_REPORT_PRINTING = "กำลังพิมพ์รายงาน..."
IDS_CVL_REPORT_GENERATING = "กำลังสร้างรายงาน..."
IDS_CVL_RPT_SNiP_Spartial_Section = "การคำนวณกำลังของหน้าตัดเอลิเมนต์เชิงพื้นที่"
IDS_CVL_RPT_SNiP_Not_required = "ไม่จำเป็น"
IDS_SP16_Par711_Title = "การคำนวณกำลังของเอลิเมนต์ภายใต้แรงดึงหรือแรงอัดตามแนวแกน (par. 7.1.1)"
IDS_SP16_Par713_Title = "การคำนวณเสถียรภาพของเอลิเมนต์หน้าตัดทึบภายใต้แรงอัดตามแนวแกน (par. 7.1.3)"
IDS_SP16_Par715_Title = "เสถียรภาพภายใต้การสูญเสียเสถียรภาพแบบดัด-บิดของหน้าตัดเปิด (par. 7.1.5)"
IDS_SP16_Par723_Title = "การคำนวณค่าความยืดหยุ่นเชิงเงื่อนไขของแขนง (ข้อ 7.2.3)"
IDS_SP16_Par724_Title = "การคำนวณเสถียรภาพของกิ่งเดี่ยวในเอลิเมนต์หน้าตัดประกอบ (par. 7.2.4)"
IDS_SP16_Par732_Title = "เสถียรภาพของแผ่นกำแพงของเอลิเมนต์หน้าตัดทึบที่ถูกอัดตามแนวแกน (par. 7.3.2)"
IDS_SP16_Par733_Title = "แผ่นกำแพงของเอลิเมนต์หน้าตัดทึบที่ถูกอัดตามแนวแกนควรเสริมด้วยซี่โครงตามขวาง (par. 7.3.3)"
IDS_SP16_Par733_CrossRibsNotSet = "o_lambda_w > 2.3\n\nต้องมีซี่โครงตามขวาง แต่ยังไม่ได้กำหนด"
IDS_SP16_Par733_CheckCrossRibFrequency = "o_lambda_w > 2.3\n\nต้องมีซี่โครงตามขวางและได้กำหนดแล้ว กำลังตรวจสอบความเพียงพอของความถี่ซี่โครงตามขวาง:"
IDS_SP16_Par733_CrossRibsAreNotRequired = "o_lambda_w <= 2.3\n\nไม่จำเป็นต้องมีซี่โครงตามขวาง"
IDS_SP16_Par738_Title = "เสถียรภาพของแผ่นคอร์ดของเอลิเมนต์หน้าตัดทึบที่ถูกอัดตามแนวแกน (par. 7.3.8)"
IDS_SP16_Par821_Title = "การคำนวณกำลังของคานคลาส 1: ภายใต้การกระทำของโมเมนต์ดัด (par. 8.2.1)"
IDS_SP16_ParTau_Title = "การตรวจสอบหน้าตัดสำหรับแรงเฉือน"
IDS_SP16_Par823_Title = "การคำนวณกำลังของคานประกอบของคานรูปตัว I และหน้าตัดกล่อง คลาส 2 และ 3: ภายใต้การกระทำของโมเมนต์ดัด (par. 8.2.3)"
IDS_SP16_Par841_Title = "การคำนวณเสถียรภาพของคานรูปตัว I คลาส 1: ภายใต้การกระทำของโมเมนต์ดัด (par. 8.4.1)"
IDS_SP16_Par851_Title = "เสถียรภาพของแผ่นกำแพงคานคลาส 1: ภายใต้การกระทำของโมเมนต์ดัด (par. 8.5.1)"
IDS_SP16_Par853_Title = "เสถียรภาพของแผ่นกำแพงคานคลาส 1 หน้าตัดสมมาตรเมื่อมีความเค้นเฉพาะที่: ภายใต้การกระทำของโมเมนต์ดัด (par. 8.5.3)"
IDS_SP16_Par857_Title = "เสถียรภาพของแผ่นกำแพงของคานคลาส 1 หน้าตัดรูปตัว I ไม่สมมาตรที่มีปีกด้านแรงดึงพัฒนามากกว่า (par. 8.5.7)"
IDS_SP16_Par858_Title = "เสถียรภาพของแผ่นกำแพงคานคลาส 2 และ 3 ที่ทำจากเหล็กเนื้อเดียวกันเมื่อไม่มีความเค้นเฉพาะที่ (Sigma_loc = 0) (par. 8.5.8)"
IDS_SP16_Par822_Title = "การคำนวณกำลังของแผ่นกำแพงคานที่ไม่ได้เสริมด้วยสติฟฟ์เนอร์ภายใต้การกระทำของความเค้นเฉพาะที่ (par. 8.2.2)"
IDS_SP16_Par8518_Title = "เสถียรภาพของคอร์ดที่ถูกอัดของคานคลาส 1 (par. 8.5.18)"
IDS_SP16_Par8519_Title = "เสถียรภาพของคอร์ดที่ถูกอัดของคานคลาส 2, 3 (par. 8.5.19)"
IDS_SP16_Par911_Title = "การคำนวณกำลังของเอลิเมนต์ที่ถูกอัดเยื้องศูนย์และถูกดึงเยื้องศูนย์ (par. 9.1.1)"
IDS_SP16_Par913_Title = "การทดสอบกำลังรับแรงดึงของหน้าตัดเส้นใยของเอลิเมนต์ที่ถูกอัดเยื้องศูนย์ที่มีหน้าตัดไม่สมมาตร (par. 9.1.3)"
IDS_SP16_Par922_Title = "การคำนวณเสถียรภาพของเอลิเมนต์ที่ถูกอัดเยื้องศูนย์ในระนาบการกระทำของโมเมนต์ดัดซึ่งตรงกับระนาบสมมาตร (par. 9.2.2)"
IDS_SP16_Par928_Title = "การคำนวณเสถียรภาพของเอลิเมนต์ที่ถูกอัดเยื้องศูนย์ซึ่งดัดในระนาบที่มีความแข็งน้อยที่สุด (par. 9.2.8)"
IDS_SP16_Par929_Title = "การคำนวณเสถียรภาพของชิ้นส่วนแท่ง (ยกเว้นแบบหน้าตัดกล่อง) ที่รับแรงอัดและดัดในสองระนาบหลัก (par. 9.2.9)"
IDS_SP16_Par9210_Title = "การคำนวณเสถียรภาพของชิ้นส่วนแท่ง (หน้าตัดกล่อง) ที่รับแรงอัดและดัดในสองระนาบหลัก (par. 9.2.10)"
IDS_SP16_Par924_Title = "การคำนวณเสถียรภาพของแท่งที่ถูกอัดเยื้องศูนย์นอกระนาบการกระทำของโมเมนต์ดัด ระหว่างการดัดในระนาบที่มีความแข็งมากที่สุด (par. 9.2.4)"
IDS_SP16_Par942_Title = "เสถียรภาพของแผ่นกำแพงของเอลิเมนต์ที่ถูกอัดเยื้องศูนย์ (par. 9.4.2)"
IDS_SP16_Par947_Title = "เสถียรภาพของแถบ (ปีก) ของแท่งที่ถูกอัดเยื้องศูนย์ (par. 9.4.7)"
IDS_SP16_Par1041_Title = "ความยาวออกแบบสูงสุดของเอลิเมนต์ (par. 10.4.1)"
IDS_SP16_Par1122_Title = "การคำนวณเสถียรภาพของแผ่นกำแพงของท่อไร้ตะเข็บหรือท่อเชื่อมด้วยไฟฟ้า (par. 11.2.2)"
IDS_SP16_Par1122_FurtherChecksAreNotNeeded = "o_lambda < 0.65\n ไม่จำเป็นต้องตรวจสอบเพิ่มเติม"
IDS_SP16_COEFFS_FOR_SECTION_TYPE = "สำหรับหน้าตัดชนิด %s ค่าสัมประสิทธิ์คือ: %s"
IDS_SP16_COEFFS_FOR_UNKNOWN_SECTION_TYPE = "ไม่ทราบชนิดหน้าตัด ค่าสัมประสิทธิ์คือ: %s"
IDS_SP16_CALC_LAMBDA_EF_COMBINED_SECTION = "การคำนวณค่าความอ่อนตัว lambda_ef ของเอลิเมนต์หน้าตัดโปร่ง"
IDS_SP16_COMB_SECT_TYPE1_BRANCHES_WITH_PLANKS = "ชนิดหน้าตัด: 1, กิ่งเชื่อมต่อกันด้วยแผ่นเพลท"
IDS_SP16_COMB_SECT_TYPE1_BRANCHES_WITH_LATTICE = "ชนิดหน้าตัด: 1, กิ่งเชื่อมต่อกันด้วยโครงตาข่าย"
IDS_SP16_CALC_PHI_COEFF = "การคำนวณค่าสัมประสิทธิ์ phi"
IDS_SP16_CALC_PHI_E_REG_ELEMENT = "การคำนวณค่าสัมประสิทธิ์เสถียรภาพ phi_e ภายใต้แรงอัดเยื้องศูนย์ของเอลิเมนต์หน้าตัดทึบ"
IDS_SP16_CALC_PHI_E_FROM_D3_TABLE = "จากตาราง D.3 สำหรับ o_lambda_ef = %g และ m = %g"
IDS_SP16_CALC_PHI_E_COMB_ELEMENT = "การคำนวณค่าสัมประสิทธิ์เสถียรภาพ phi_e ภายใต้แรงอัดเยื้องศูนย์ของเอลิเมนต์หน้าตัดโปร่ง"
IDS_SP16_CALC_PHI_E_FROM_D4_TABLE = "จากตาราง D.4 สำหรับ o_lambda_ef = %g และ m = %g"
IDS_SP16_CALC_REDUCED_AREA_AD = "การคำนวณพื้นที่ลดรูป Ad"
IDS_SP16_SECT_TYPE_TABLE_7 = "ชนิดหน้าตัดจากตาราง 7:"
IDS_SP16_REQUIREMENTS_OF_732_NOT_SATISFIED = "ไม่เป็นไปตามข้อกำหนดของข้อ 7.3.2 คำนวณโดยใช้พื้นที่ลดรูป"
IDS_SP16_REQUIREMENTS_OF_942_NOT_SATISFIED = "ไม่เป็นไปตามข้อกำหนดของข้อ 9.4.2 คำนวณโดยใช้พื้นที่ลดรูป"
IDS_SP16_CALCULATION_OF_TABLE_9 = "การคำนวณค่าความอ่อนตัวตามเงื่อนไขของเว็บค่าสูงสุด (ตาราง 9)"
IDS_SP16_CALCULATION_OF_TABLE_10 = "การคำนวณค่าความอ่อนตัวตามเงื่อนไขของปีกค่าสูงสุด (ตาราง 10)"
IDS_SP16_CALCULATION_OF_HD_CENTRALLY_COMPRESSED = "การคำนวณ hd สำหรับเอลิเมนต์ที่ถูกอัดตามแนวแกน"
IDS_SP16_CALCULATION_OF_HD_CENTRALLY_UNCOMPRESSED = "การคำนวณ hd สำหรับเอลิเมนต์ที่ไม่ถูกอัดตามแนวแกน"
IDS_SP16_CALCULATION_OF_BD = "การคำนวณ bd"
IDS_SP16_CALCULATION_OF_TABLE_D6 = "การคำนวณ ω, α, β จากตาราง D.6"
IDS_SP16_CALCULATION_OF_CMAX_SECT_TYPE_4 = "การคำนวณค่าสัมประสิทธิ์ Cmax ชนิดหน้าตัด: 4"
IDS_SP16_CALCULATION_OF_TABLE_E1 = "การคำนวณค่าสัมประสิทธิ์ Cy, Cz, n (ตาราง E.1)"
IDS_SP16_FOR_AF_AW_MSG = "สำหรับ Af = %g, Aw = %g"
IDS_SP16_CALCULATION_TABLE_ZH4 = "การคำนวณค่าสัมประสิทธิ์ B (ตาราง ZH.4)"
IDS_SP16_CALCULATION_TABLE_ZH5 = "การคำนวณค่าสัมประสิทธิ์ C และ D (ตาราง ZH.5)"
IDS_SP16_UNIT_LENGTH_MM = "mm"
IDS_SP16_UNIT_LENGTH_CM = "cm"
IDS_SP16_UNIT_LENGTH_M = "m"
IDS_SP16_UNIT_LENGTH_IN = "in"
IDS_SP16_UNIT_LENGTH_FT = "ft"
IDS_SP16_UNIT_FORCE_KG = "kgf"
IDS_SP16_UNIT_FORCE_TON = "tonf"
IDS_SP16_UNIT_FORCE_N = "N"
IDS_SP16_UNIT_FORCE_KN = "kN"
IDS_SP16_UNIT_FORCE_LBF = "lbf"
IDS_SP16_UNIT_FORCE_KIP = "kip"
IDS_SP16_UNIT_FORCE_KIPs = "kips"
IDS_SP16_RATIO = "rat"
IDS_SNiP_REPORT_SECT_REDESIGN = "ต้องออกแบบหน้าตัดใหม่"
IDS_SNiP_REPORT_NOT_REQ_REBAR = "∴ ไม่จำเป็นต้องใช้เหล็กเสริม"
IDS_SNiP_REPORT_REQ_REBAR = "∴ จำเป็นต้องใช้เหล็กเสริม"
IDS_RUS_CODE_REPORT_CH_TEST = "RUS_Report_CH-Test(Lang:CH)"
IDS_RUS_CODE_REPORT_JP_TEST = "EC_Report_JP-Test(Lang:JP)"
IDS_RUS_CODE_REPORT_KR_TEST = "EC_Report_KR-Test(Lang:KR)"
IDS_RUS_CODE_RUS_TEST = "EC_Report_RUS-Test(Lang:RUS)"
IDS_RUS_CODE_REPORT_TW_TEST = "EC_Report_TW-Test(Lang:TW)"
IDS_SP16_BIG_MY_LINEAR_INTERPOLATION_NOTE = "The value of m_y is > 5. The value of %s is determined by linear interpolation."
